heatExchanger/constant/air/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/air/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          10800;
        startFace       718740;
    }
    inlet
    {
        type            patch;
        nFaces          4500;
        startFace       729540;
    }
    outlet
    {
        type            patch;
        nFaces          4500;
        startFace       734040;
    }
    blades
    {
        type            wall;
        inGroups        List<word> 
2
(
wall
baffles
)
;
        nFaces          720;
        startFace       738540;
    }
)

// ************************************************************************* //
